#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_pubsub_topic.ldn_arrive_topic: Refreshing state... [id=projects/de-challenge-336404/topics/lnd-notification]
module.landing-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-lnd]
module.analytics-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-analytics]
google_project_service.cloudresourcemanager: Refreshing state... [id=de-challenge-336404/cloudresourcemanager.googleapis.com]
module.raw-bucket-metascore.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-metascore-raw]
module.analytics_dataset["consumption"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption]
module.artifacts-bucket.google_storage_bucket.bucket: Refreshing state... [id=de-challenge-336404-artifacts]
module.analytics_dataset["staging"].google_bigquery_dataset.main: Refreshing state... [id=projects/de-challenge-336404/datasets/staging]
module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-artifacts/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:zahid.galea@wom.cl]
module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com]
module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"]: Refreshing state... [id=b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl]
google_pubsub_topic_iam_binding.ldn_arrive_binding: Refreshing state... [id=projects/de-challenge-336404/topics/lnd-notification/roles/pubsub.publisher]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_viewer["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Gustavo.Aguilar0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:gustavo.aguilar0@walmart.com]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:Mariano.Gonzalez0@walmart.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:mariano.gonzalez0@walmart.com]
module.analytics_dataset_data_viewer["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahid.galea@wom.cl"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataViewer/user:zahid.galea@wom.cl]
module.analytics_dataset_data_owner["consumption"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/consumption/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
module.analytics_dataset_data_owner["staging"].google_bigquery_dataset_iam_member.dataset_iam["user:zahidale.zg@gmail.com"]: Refreshing state... [id=projects/de-challenge-336404/datasets/staging/roles/bigquery.dataOwner/user:zahidale.zg@gmail.com]
google_storage_notification.object_landing_notification: Refreshing state... [id=de-challenge-336404-metascore-lnd/notificationConfigs/7]
google_project_service.project["storage-component.googleapis.com"]: Refreshing state... [id=de-challenge-336404/storage-component.googleapis.com]
google_project_service.project["container.googleapis.com"]: Refreshing state... [id=de-challenge-336404/container.googleapis.com]
google_project_service.project["workflows.googleapis.com"]: Refreshing state... [id=de-challenge-336404/workflows.googleapis.com]
google_project_service.project["datastudio.googleapis.com"]: Refreshing state... [id=de-challenge-336404/datastudio.googleapis.com]
google_project_service.project["dataflow.googleapis.com"]: Refreshing state... [id=de-challenge-336404/dataflow.googleapis.com]
google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iam.googleapis.com]
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=de-challenge-336404/compute.googleapis.com]
google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudbuild.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=de-challenge-336404/iamcredentials.googleapis.com]
google_project_service.project["appengine.googleapis.com"]: Refreshing state... [id=de-challenge-336404/appengine.googleapis.com]
google_project_service.project["bigquery.googleapis.com"]: Refreshing state... [id=de-challenge-336404/bigquery.googleapis.com]
google_project_service.project["cloudfunctions.googleapis.com"]: Refreshing state... [id=de-challenge-336404/cloudfunctions.googleapis.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_pubsub_topic.ldn_arrive_topic has changed
  ~ resource "google_pubsub_topic" "ldn_arrive_topic" {
        id      = "projects/de-challenge-336404/topics/lnd-notification"
      + labels  = {}
        name    = "lnd-notification"
        # (1 unchanged attribute hidden)
    }

  # google_storage_notification.object_landing_notification has changed
  ~ resource "google_storage_notification" "object_landing_notification" {
      + custom_attributes = {}
        id                = "de-challenge-336404-metascore-lnd/notificationConfigs/7"
        # (6 unchanged attributes hidden)
    }

  # module.artifacts-bucket.google_storage_bucket.bucket has changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "de-challenge-336404-artifacts"
      + labels                      = {}
        name                        = "de-challenge-336404-artifacts"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAM=" -> "CAU="
        id     = "b/de-challenge-336404-artifacts/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAY=" -> "CAg="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectAdmin/user:zahidale.zg@gmail.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAY=" -> "CAg="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAY=" -> "CAg="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com"
        # (3 unchanged attributes hidden)
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] has changed
  ~ resource "google_storage_bucket_iam_member" "members" {
      ~ etag   = "CAY=" -> "CAg="
        id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-analytics"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectAdmin"
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-analytics" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com" -> null
      - member = "user:gustavo.aguilar0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-analytics" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com" -> null
      - member = "user:mariano.gonzalez0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.analytics-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be destroyed
  # (because key ["roles/storage.objectViewer user:zahid.galea@wom.cl"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-analytics" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-analytics/roles/storage.objectViewer/user:zahid.galea@wom.cl" -> null
      - member = "user:zahid.galea@wom.cl" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectAdmin"
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-artifacts" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com" -> null
      - member = "user:gustavo.aguilar0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-artifacts" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com" -> null
      - member = "user:mariano.gonzalez0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.artifacts-bucket.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be destroyed
  # (because key ["roles/storage.objectViewer user:zahid.galea@wom.cl"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-artifacts" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-artifacts/roles/storage.objectViewer/user:zahid.galea@wom.cl" -> null
      - member = "user:zahid.galea@wom.cl" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-lnd"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectAdmin"
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-lnd" -> null
      - etag   = "CAg=" -> null
      - id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com" -> null
      - member = "user:gustavo.aguilar0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-lnd" -> null
      - etag   = "CAg=" -> null
      - id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com" -> null
      - member = "user:mariano.gonzalez0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.landing-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be destroyed
  # (because key ["roles/storage.objectViewer user:zahid.galea@wom.cl"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-lnd" -> null
      - etag   = "CAg=" -> null
      - id     = "b/de-challenge-336404-metascore-lnd/roles/storage.objectViewer/user:zahid.galea@wom.cl" -> null
      - member = "user:zahid.galea@wom.cl" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-metascore-raw"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectAdmin"
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Gustavo.Aguilar0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-raw" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:gustavo.aguilar0@walmart.com" -> null
      - member = "user:gustavo.aguilar0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] will be destroyed
  # (because key ["roles/storage.objectViewer user:Mariano.Gonzalez0@walmart.com"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-raw" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:mariano.gonzalez0@walmart.com" -> null
      - member = "user:mariano.gonzalez0@walmart.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.raw-bucket-metascore.google_storage_bucket_iam_member.members["roles/storage.objectViewer user:zahid.galea@wom.cl"] will be destroyed
  # (because key ["roles/storage.objectViewer user:zahid.galea@wom.cl"] is not in for_each map)
  - resource "google_storage_bucket_iam_member" "members" {
      - bucket = "b/de-challenge-336404-metascore-raw" -> null
      - etag   = "CAU=" -> null
      - id     = "b/de-challenge-336404-metascore-raw/roles/storage.objectViewer/user:zahid.galea@wom.cl" -> null
      - member = "user:zahid.galea@wom.cl" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.temporary-bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "de-challenge-336404-temporary-pipeline"
      + project                     = "de-challenge-336404"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.temporary-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Gustavo.Aguilar0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-temporary-pipeline"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Gustavo.Aguilar0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.temporary-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:Mariano.Gonzalez0@walmart.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-temporary-pipeline"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:Mariano.Gonzalez0@walmart.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.temporary-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahid.galea@wom.cl"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-temporary-pipeline"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahid.galea@wom.cl"
      + role   = "roles/storage.objectAdmin"
    }

  # module.temporary-bucket.google_storage_bucket_iam_member.members["roles/storage.objectAdmin user:zahidale.zg@gmail.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "de-challenge-336404-temporary-pipeline"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "user:zahidale.zg@gmail.com"
      + role   = "roles/storage.objectAdmin"
    }

Plan: 17 to add, 0 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ZahidGalea, Action: `pull_request`, Working Directory: `infraestructure/terraform/de-challenge`, Workflow: `Terraform Planning`*